/*给定一个5X5的整数矩阵，找出其中最小的元素，输出所在的行号、列号和元素值，其中行号和列号都从0开始。
例如，有矩阵：
5 86 53 50 18
25 67 79 44 68
79 63 24 84 100
42 30 59 47 37
28 10 32 23 81
其中最小元素的行号和列号都是0，值是5
输入格式
一个5X5的矩阵，数据之间用空格隔开
输出格式
一行，依次输出最小元素所在的行号、列号和值，中间以两个空格分隔
输入样例
62 54 79 82 33 
88 45 91 14 58 
71 53 11 59 35 
35 37 14 46 67 
85 63 72 99 30
输出样例
2  2  11*/
#include<stdio.h>
int main(){
    int arr[5][5];
    for (int  i = 0; i < 5; i++){
       for (int j= 0; j< 5; j++){
        scanf("%d",&arr[i][j]);
       }
    }
    int min=arr[0][0];
    int min_i,min_j;
     for (int  i = 0; i < 5; i++){
       for (int j= 0; j< 5; j++){
        if(arr[i][j]<min){
            //若有相等，输出前一个
            min=arr[i][j];
            min_i=i;
            min_j=j;
        }
       }
    }
    printf("%d  %d  %d",min_i,min_j,min);//有两个空格
    return 0;
}